GroupBy & Aggregation

In [1]:
import pandas as pd

data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'A', 'B', 'B', 'A', 'B', 'A', 'B'],
    'Store':    ['S1', 'S2', 'S1', 'S2', 'S1', 'S2', 'S2', 'S1', 'S1', 'S2', 'S2', 'S1'],
    'Sales':    [100, 200, 150, 250, 120, 180, 220, 300, 160, 210, 190, 310],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25, 11, 17, 22, 30],
    'Date':     pd.date_range('2023-01-01', periods=12)
}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

   Category Store  Sales  Quantity       Date
0         A    S1    100        10 2023-01-01
1         B    S2    200        15 2023-01-02
2         A    S1    150        12 2023-01-03
3         B    S2    250        18 2023-01-04
4         A    S1    120         8 2023-01-05
5         A    S2    180        20 2023-01-06
6         B    S2    220        15 2023-01-07
7         B    S1    300        25 2023-01-08
8         A    S1    160        11 2023-01-09
9         B    S2    210        17 2023-01-10
10        A    S2    190        22 2023-01-11
11        B    S1    310        30 2023-01-12

In [4]:
cat =  df.groupby("Category")
for v in cat:
    #print(i)
    print(v)

('A',    Category Store  Sales  Quantity       Date
0         A    S1    100        10 2023-01-01
2         A    S1    150        12 2023-01-03
4         A    S1    120         8 2023-01-05
5         A    S2    180        20 2023-01-06
8         A    S1    160        11 2023-01-09
10        A    S2    190        22 2023-01-11)
('B',    Category Store  Sales  Quantity       Date
1         B    S2    200        15 2023-01-02
3         B    S2    250        18 2023-01-04
6         B    S2    220        15 2023-01-07
7         B    S1    300        25 2023-01-08
9         B    S2    210        17 2023-01-10
11        B    S1    310        30 2023-01-12)

In [5]:
cat =  df.groupby("Category")
for i,v in cat:
    print(i)
    print(v)

A
   Category Store  Sales  Quantity       Date
0         A    S1    100        10 2023-01-01
2         A    S1    150        12 2023-01-03
4         A    S1    120         8 2023-01-05
5         A    S2    180        20 2023-01-06
8         A    S1    160        11 2023-01-09
10        A    S2    190        22 2023-01-11
B
   Category Store  Sales  Quantity       Date
1         B    S2    200        15 2023-01-02
3         B    S2    250        18 2023-01-04
6         B    S2    220        15 2023-01-07
7         B    S1    300        25 2023-01-08
9         B    S2    210        17 2023-01-10
11        B    S1    310        30 2023-01-12

In [6]:
total_Quantity =  df.groupby("Category")["Quantity"].sum()
total_Quantity

Category
A     83
B    120
Name: Quantity, dtype: int64

In [7]:
total_Sales =  df.groupby("Category")["Sales"].sum()
total_Sales

Category
A     900
B    1490
Name: Sales, dtype: int64

In [8]:
mean_Sales =  df.groupby("Category")["Sales"].mean()
mean_Sales

Category
A    150.000000
B    248.333333
Name: Sales, dtype: float64

In [9]:
count = df.groupby("Category")["Sales"].count()
count

Category
A    6
B    6
Name: Sales, dtype: int64

In [10]:
sum = df.groupby(["Category","Store"])["Sales"].sum()
sum

Category  Store
A         S1       530
          S2       370
B         S1       610
          S2       880
Name: Sales, dtype: int64

In [11]:
sum = df.groupby(["Category","Store"])["Quantity"].sum()
sum

Category  Store
A         S1       41
          S2       42
B         S1       55
          S2       65
Name: Quantity, dtype: int64

In [12]:
mean = df.groupby(["Category","Store"])["Sales"].mean()
mean

Category  Store
A         S1       132.5
          S2       185.0
B         S1       305.0
          S2       220.0
Name: Sales, dtype: float64

In [13]:
count = df.groupby(["Category","Store"])["Sales"].count()
count

Category  Store
A         S1       4
          S2       2
B         S1       2
          S2       4
Name: Sales, dtype: int64

Aggregation

In [15]:
df["Sales"].mean()
# median, mode,min, mean, max, count, std

np.float64(199.16666666666666)

In [20]:
df["Sales"].std()

64.731379679036

In [22]:
df["Sales"].agg(["median","min", "mean", "max", "count", "std"])

median    195.000000
min       100.000000
mean      199.166667
max       310.000000
count      12.000000
std        64.731380
Name: Sales, dtype: float64

In [23]:
df["Sales"].agg(["mode"])

    mode
0    100
1    120
2    150
3    160
4    180
5    190
6    200
7    210
8    220
9    250
10   300
11   310